In [1]:
import pandas as pd

In [ ]:
#IMPORT DATASET

In [3]:
df = pd.read_excel('data.xlsx', sheet_name = 'BA_task_3')

       Month  Product    Revenue    Profit
0 2020-01-12  PayAlto   84021.66    909.11
1 2020-02-12  PayAlto  165429.59   5395.30
2 2020-03-12  PayAlto  291906.14  12144.56
3 2020-04-12  PayAlto  357797.28   5604.51
4 2020-05-12  PayAlto  375421.56   6400.34

In [ ]:
#DATA INFO

In [4]:
df.shape

(119, 4)

In [5]:
df.head()

       Month  Product    Revenue    Profit
0 2020-01-12  PayAlto   84021.66    909.11
1 2020-02-12  PayAlto  165429.59   5395.30
2 2020-03-12  PayAlto  291906.14  12144.56
3 2020-04-12  PayAlto  357797.28   5604.51
4 2020-05-12  PayAlto  375421.56   6400.34

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 119 entries, 0 to 118
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Month    119 non-null    datetime64[ns]
 1   Product  119 non-null    object
 2   Revenue  119 non-null    float64
 3   Profit   119 non-null    float64
dtypes: datetime64[ns](1), float64(2), object(1)
memory usage: 3.8+ KB

In [7]:
df.dtypes

Month      datetime64[ns]
Product            object
Revenue           float64
Profit            float64
dtype: object

In [ ]:
#CHECK MISSING VALUES

In [8]:
df.isna().sum()

Month      0
Product    0
Revenue    0
Profit     0
dtype: int64

There are no missing values in the dataset

In [ ]:
#CHECK DUPLICATED VALUES

In [9]:
df.duplicated().sum()

0

There are no dulicated values in the dataset

In [ ]:
#QUESTION 1: Calculate annual Revenue and Profit for each product.

In [13]:
annual_summary = df.groupby('Product').agg({'Revenue' : 'sum','Profit': 'sum'}).reset_index()
annual_summary

   Product       Revenue      Profit
0  Mobiamo  3.268056e+08  6426827.26
1  PayAlto  3.694835e+08  7762974.27

In [ ]:
#QUESTION 2: The Project Managers (PM) for PayAlto and Mobiamo are John Doe and Kelly Nguyen respectively. From the result of question 1, show in table the PM for each product. You need to create a new project manager-product table.

In [17]:
#SHOW PM FOR EACH PRODUCT
annual_summary['project_manager'] = annual_summary['Product'].map({'Mobiamo': 'John Doe','PayAlto': 'Kelly Nguyen'})

annual_summary = annual_summary[['Product', 'project_manager', 'Revenue', 'Profit']]

annual_summary

   Product project_manager       Revenue      Profit
0  Mobiamo        John Doe  3.268056e+08  6426827.26
1  PayAlto    Kelly Nguyen  3.694835e+08  7762974.27

In [21]:
#CREATE NEW PM-PRODUCT TABLE
project_manager_table = annual_summary[['project_manager','Product']]

project_manager_table

  project_manager  Product
0        John Doe  Mobiamo
1    Kelly Nguyen  PayAlto

In [ ]:
#QUESTION 3: From the result of question 2, please transform the table to long format.

In [26]:
#MELT PROFIT AND REVENUE TO ONE COLUMN
long_format_summary = pd.melt(annual_summary, id_vars=['Product', 'project_manager'], var_name='metric', value_name='amount').sort_values(by = 'Product')

long_format_summary

   Product project_manager   metric        amount
0  Mobiamo        John Doe  Revenue  3.268056e+08
2  Mobiamo        John Doe   Profit  6.426827e+06
1  PayAlto    Kelly Nguyen  Revenue  3.694835e+08
3  PayAlto    Kelly Nguyen   Profit  7.762974e+06